tap "homebrew/cask"

brew "bat"                     # Better cat
brew "coreutils"               # GNU coreutils instead of BSD
brew "fd"                      # Better find
brew "fzf"                     # Fuzzy finder
brew "git"
brew "htop"                    # Better top
brew "less"
brew "pyenv"                   # python version manager
brew "pyenv-virtualenv"        # virtual env manager plugin for pyenv
brew "ripgrep"                 # Better grep
brew "stow"                    # Symlink farm manager
brew "tmux"
brew "tree"                    # Filesystem tree view
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"] # ctags

