tap "homebrew/cask"
tap "koekeishiya/formulae"
tap "mattbedell/formulae"

brew "bat"                     # Better cat
brew "coreutils"               # GNU coreutils instead of BSD
brew "dict"                    # Dictionary server protocol client
brew "efm-langserver"          # LSP linting/diagnostics
brew "exa"                     # Better ls
brew "fd"                      # Better find
brew "findutils"               # GNU instead of BSD
brew "fzf"                     # Fuzzy finder
brew "fzy"                     # Fuzzy finder (telescope.nvim)
brew "gh"                      # Github CLI
brew "git"
brew "git-delta"               # Git diffs
brew "htop"                    # Better top
brew "jq"                      # Json processor
brew "less"
brew "llvm"                    # Compiler + toolchain
brew "mdrender"                # mattbedell/mdrender Render markdown files in the terminal
brew "neovim"
brew "nvim"
brew "pandoc"                  # File format converter
brew "pyenv"                   # Python version manager
brew "pyenv-virtualenv"        # Virtual env manager plugin for pyenv
brew "ripgrep"                 # Better grep
brew "skhd"                    # Hotkey daemon
brew "stow"                    # Symlink farm manager
brew "task"                    # Taskwarrior CLI todo list
brew "tasksh"                  # Taskwarrior shell
brew "tfenv"                   # Terraform version manager
brew "tmux"
brew "tree"                    # Filesystem tree view
brew "vifm"                    # Terminal file manager
brew "vim"
brew "yabai"                   # tiling window manager
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"] # Ctags

